In [2]:
import pandas as pd
df = pd.read_excel("nilai_mhs.xlsx")
df

    Nim  Nama   Kode           Matakuliah  Nilai
0  1001   Ani  T0001          Pemrograman     80
1  1002   Ana  T0001          Pemrograman     40
2  1003  Alex  P0001  Praktik Pemrograman     50
3  1002   Ana  P0001  Praktik Pemrograman     95
4  1001   Ani  P0001  Praktik Pemrograman    100
5  1001   Ani  T0001           Matematika     10
6  1002   Ana  T0001           Matematika     50
7  1002   Ana  T0001           Matematika     60
8  1003  Alex  T0001           Matematika     70
9  1003  Alex  T0001          Pemrograman     87

In [3]:
def nilai_huruf(nilai):
    if nilai>=80:
        return 'A'
    elif nilai>=70:
        return 'B'
    elif nilai>=60:
        return 'C'
    elif nilai>=40:
        return 'D'
    else:
        return 'E'
df['skor'] = df['Nilai'].apply(nilai_huruf)
print(df)

    Nim  Nama   Kode           Matakuliah  Nilai skor
0  1001   Ani  T0001          Pemrograman     80    A
1  1002   Ana  T0001          Pemrograman     40    D
2  1003  Alex  P0001  Praktik Pemrograman     50    D
3  1002   Ana  P0001  Praktik Pemrograman     95    A
4  1001   Ani  P0001  Praktik Pemrograman    100    A
5  1001   Ani  T0001           Matematika     10    E
6  1002   Ana  T0001           Matematika     50    D
7  1002   Ana  T0001           Matematika     60    C
8  1003  Alex  T0001           Matematika     70    B
9  1003  Alex  T0001          Pemrograman     87    A

In [4]:
# filter
print("----------filter----------")
x=df[df['Nim'] == 1001]
print(x)

----------filter----------
    Nim Nama   Kode           Matakuliah  Nilai skor
0  1001  Ani  T0001          Pemrograman     80    A
4  1001  Ani  P0001  Praktik Pemrograman    100    A
5  1001  Ani  T0001           Matematika     10    E

In [5]:
y = df.groupby('Nim')['Nilai'].mean()
print(y)

Nim
1001    63.333333
1002    61.250000
1003    69.000000
Name: Nilai, dtype: float64